const news = [
  {
    "title": "КРУПНОЕ ОБНОВЛЕНИЕ!!! |ОБНОВЛЕНИЕ| ОТ 23 МАРТА 2026 г.",
    "content": "УВАЖАЕМЫЕ ПОЛЬЗОВАТЕЛИ!\nСпешим сообщить вам о выходе крупного обновления нашего сайта. Мы добавили множество новых функций и улучшений, чтобы сделать ваше пребывание на сайте еще более комфортнее.\n Что нового:\n- Добавлена новая страница (вкладка) «НОВОСТИ САЙТА» в которой вы сможете ознакомиться со всеми грядущими или уже имеющимися обновлениями, исправлениями ошибок, а также с новыми ролями, которые в скором времени появятся на сайте.\n- Для каждой роли был добавлен список участников имеющие данные роли.\n- Были откорректированы (изменены) описание ролей: [100+]🔪, [500+]🔪, [1000+]🔪, [2500+]🔪\n- Были добавлены 3 новые кастомные роли. \nТак же: \n- Были исправлены следующие ошибки:\n     - Ошибка при которой у некоторых пользователей не прогружался блок с ролями.\n     - Ошибка при которой некоторые пользователи не могли зайти на сайт (из за ошибки соединения с сервером).\n     - Исправлены мелкие косяки связанные с интерфейсом и отображениями на мобильных устройствах. \nСпасибо, что остаетесь частью нашего сообщества! 🚀 Мы продолжаем прокачивать сайт и уже готовим новые обновления, роли и возможности. Следите за новостями — впереди еще больше контента и улучшений!",
    "category": "major",
    "image": "",
    "date": "2026-03-23T14:09:12.863Z"
  }
];
