const news = [
  {
    "title": "РОЛИ!!! | ДОБАВЛЕНЫ НОВЫЕ РОЛИ | ОТ 25 МАРТА 2026 г.",
    "content": "🚨 ВНИМАНИЕ, ВНИМАНИЕ ВСЕМ РЕАГЕНТАМ! 🚨\n\n⚔️ Надеемся, что лезвия ваших ножей по-прежнему остры, реакции — молниеносны, а хладнокровие крепче стали, ведь именно эти качества определяют тех, кто способен дойти до вершины.\n\nСезон в самом разгаре, и сейчас у вас есть отличная возможность доказать, что вы — не просто участники, а настоящая элита, прошедшая через давление, хаос и жесткую конкуренцию.\n\n🔥 Роль @Season 6🥇 вновь доступна и выдается тем, кто достиг Ранга Золото I в текущем сезоне, подтвердив свое мастерство и выдержку.\n\nПолную информацию так же можно получить в категории: \"🏆Достижения\"...\n\n💬 Докажите, что вы действительно достойны золота и заслуживаете место \nсреди лучших. Удачи — она понадобится каждому, кто решится сделать этот шаг.\n\n- Так же еще одна новая роль @Scavenger за прохождение всей программы \"Мусорщик\" на психохирургии на А+.\n\nПодробности о получении и скриншот доказательств можно узнать в категории: \"🎉 Ивент роли\"",
    "category": "news",
    "date": "2026-03-25T06:56:50.508Z"
  },
  {
    "title": "НОВОСТИ - ОТ 24 МАРТА 2026 г.",
    "content": "УВАЖАЕМЫ ПОЛЬЗОВАТЕЛИ!\n\nВ честь нового обновления в The Outlast Trials на сервере появятся новые роли! \n\nСовсем скоро вы узнаете, какие именно \nГотовьтесь выполнять челленджи в игре, чтобы получить их и сделать свой профиль на сервере ещё более стильным и уникальным",
    "category": "news",
    "date": "2026-03-24T15:33:17.144Z"
  },
  {
    "title": "КРУПНОЕ ОБНОВЛЕНИЕ!!! |ОБНОВЛЕНИЕ| ОТ 23 МАРТА 2026 г.",
    "content": "УВАЖАЕМЫЕ ПОЛЬЗОВАТЕЛИ!\nСпешим сообщить вам о выходе крупного обновления нашего сайта. Мы добавили множество новых функций и улучшений, чтобы сделать ваше пребывание на сайте еще более комфортнее.\n Что нового:\n- Добавлена новая страница (вкладка) «НОВОСТИ САЙТА» в которой вы сможете ознакомиться со всеми грядущими или уже имеющимися обновлениями, исправлениями ошибок, а также с новыми ролями, которые в скором времени появятся на сайте.\n- Для каждой роли был добавлен список участников имеющие данные роли.\n- Были откорректированы (изменены) описание ролей: [100+]🔪, [500+]🔪, [1000+]🔪, [2500+]🔪\n- Были добавлены 3 новые кастомные роли. \nТак же: \n- Были исправлены следующие ошибки:\n     - Ошибка при которой у некоторых пользователей не прогружался блок с ролями.\n     - Ошибка при которой некоторые пользователи не могли зайти на сайт (из за ошибки соединения с сервером).\n     - Исправлены мелкие косяки связанные с интерфейсом и отображениями на мобильных устройствах. \nСпасибо, что остаетесь частью нашего сообщества! 🚀 Мы продолжаем прокачивать сайт и уже готовим новые обновления, роли и возможности. Следите за новостями — впереди еще больше контента и улучшений!",
    "category": "major",
    "date": "2026-03-23T14:09:12.863Z"
  },
{
    "title": "НОВОСТИ - ОТ 8 АПРЕЛЯ 2026 г.",
    "content": "ВНИМАНИЕ РЕАГЕНТЫ!\n\n🔥 Ивент «Мусорщик» уже в самом разгаре! 🔥\n\n<img src=\"screenshots/Мусорщик итоги.png\">\n<p style=\"text-align: center; font-weight: 700; margin-top: 5px; margin-bottom: 15px;\">Лидерборд участников с ролью \"Scavenger\"</p>\n\n• Испытания становятся всё напряжённее, а участники — всё сильнее и хитрее.\nБорьба за выживание, сбор ресурсов и настоящая выдержка — всё это уже прямо сейчас происходит в нашем событии.\n\n• У нас уже появились первые участники, получившие роль «Scavenger».\nОни доказали, что готовы идти до конца и справляться с любыми трудностями. 💀\n\n• Но это только начало…\nВпереди ещё больше испытаний, неожиданных поворотов и новых претендентов на звание лучших.\n\n⏳У тебя ещё есть шанс ворваться в игру и оставить свой след.\nНе упусти возможность — покажи, на что ты способен!\n\nПОЛУЧИТЬ РОЛЬ \"Scavenger\" МОЖНО ДО 21 АПРЕЛЯ! ПОДРОБНЕЕ О ПОЛУЧЕНИИ И ОПИСАНИИ ДАННОЙ РОЛИ ВЫ МОЖЕТЕ ОЗНАКОМИТЬСЯ НА НАШЕМ САЙТЕ В КАТЕГОРИИ \"🎉ИВЕНТ РОЛИ\"",
    "category": "news",
    "date": "2026-04-08T11:54:48.227Z"
}
];
