const roles = [
  {
    "name": "Старший админ",
    "description": "Просто просто",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Егерь",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Начало работы с Егерем\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#9933ff",
    "gradient": "linear-gradient(135deg, #9933ff 0%, #6600cc 100%)"
  },
  {
    "name": "Season 5",
    "description": "За ..........",
    "category": "🏆 Достижения",
    "color": "#ffcc00",
    "gradient": "linear-gradient(135deg, #ffcc00 0%, #cc9900 100%)"
  },
  {
    "name": "VIP Basic",
    "description": "За ........",
    "category": "💎 Платные / VIP роли",
    "color": "#cccccc",
    "gradient": "linear-gradient(135deg, #cccccc 0%, #999999 100%)"
  },
  {
    "name": "Гемофилик",
    "description": "За .........",
    "category": "✨ Бонусные роли",
    "color": "#ffffff",
    "gradient": "linear-gradient(135deg, #ffffff 0%, #e6e6e6 100%)"
  },
  {
    "name": "Кошмар реагентов",
    "description": "За .........",
    "category": "🎭 Кастомные роли",
    "color": "#333333",
    "gradient": "linear-gradient(135deg, #333333 0%, #000000 100%)"
  },
  {
    "name": "Реагент",
    "description": "За ..........",
    "category": "👥 Основные роли",
    "color": "#ff9933",
    "gradient": "linear-gradient(135deg, #ff9933 0%, #cc6600 100%)"
  },
  {
    "name": "Winter Kills",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Winter Kills\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#33ffff",
    "gradient": "linear-gradient(135deg, #33ffff 0%, #00cccc 100%)"
  },
  {
    "name": "Знаток Пожарной Опасности",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Глубокий ожог\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#ff9933",
    "gradient": "linear-gradient(135deg, #ff9933 0%, #cc6600 100%)"
  },
  {
    "name": "Prime Time",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Prime Time\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#cccccc",
    "gradient": "linear-gradient(135deg, #cccccc 0%, #999999 100%)"
  },
  {
    "name": "Geister",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Geister\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#990000",
    "gradient": "linear-gradient(135deg, #990000 0%, #660000 100%)"
  },
  {
    "name": "Кресс",
    "description": "Данную роль можно получить следующим образом: Пройти (все задания/миссии) программы \"Kress twins (Близнецы Кресс)\" на сложности ПСИХОХИРУРГИЯ на оценку А+",
    "category": "🎉 Ивент роли",
    "color": "#ff33cc",
    "gradient": "linear-gradient(135deg, #ff33cc 0%, #cc0099 100%)"
  },
    {
    "name": "Founder",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Зам",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#9933ff",
    "gradient": "linear-gradient(135deg, #9933ff 0%, #6600cc 100%)"
  },
  {
    "name": "developer",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Технический специалист Меркофф",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
    {
    "name": "Администрация",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Менеджер по реагентам",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Ивент менеджер Меркофф",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Гл. Сотрудник Меркофф",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Главный админ",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Модераторы",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#0c4897",
    "gradient": "linear-gradient(135deg, #333333 0%, #000000 100%)"
  },
  {
    "name": "Red Barrels",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Художник Синьялы",
    "description": "У данной роли нет описания, так как она относится к категории «Администрация».",
    "category": "🛡️ Администрация",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Секси",
    "description": "У данной роли нет описания, так как она относится к категории «Кастомные роли».",
    "category": "🎭 Кастомные роли",
    "color": "#ff66cc",
    "gradient": "linear-gradient(135deg, #ff66cc 0%, #cc3399 100%)"
  },
  {
    "name": "Gde_Sтароста",
    "description": "У данной роли нет описания, так как она относится к категории «Кастомные роли».",
    "category": "🎭 Кастомные роли",
    "color": "#da2b2b",
    "gradient": "linear-gradient(135deg, #ff3333 0%, #cc0000 100%)"
  },
  {
    "name": "Скебоб",
    "description": "У данной роли нет описания, так как она относится к категории «Кастомные роли».",
    "category": "🎭 Кастомные роли",
    "color": "#cccccc",
    "gradient": "linear-gradient(135deg, #cccccc 0%, #999999 100%)"
  }
];
];


